[
    {
        "title": "Realizing New Year's Resolution 2017",
        "content": "<p><em>As the clock struck</em> <em>mid-night</em> I was sitting snuggled deep into my blanket in an upright position at the corner of my room listening to Red Hot Chili Peppers. I came to know it was new year when I heard&nbsp;the celebration. I was feeling good, the feeling of new beginnings kept me in high spirits. I thought at last this could be my break from the surmounting guilt of lost passion, for this would be my year! I will get back to Competitive Programming and practice even harder than the second-half of 2015. I felt like making new year's resolutions, I usually didn't believed in new year's resolution or any type of resolution at all, because I had failed at them countless times before. But that night, as I said the soothing feelings of new beginnings had already swept me away, so I gave it another try. Needless to say I failed miserably but that comes way later in the story, will talk about that another time.</p><p>Among other new year's resolution one resolution was to document my life better, I felt there were way too many memories to hold in my head. I kept forgetting them if I didn't thought about them in a long time. That fact in actual seriousness is scientifically correct. I made a plan to document my life better, althought not knowing how to do it. My music history was being documented by last.fm which was one of the most important among the things to be documented. Another important thing to be documented was memories in the form of stories. This blog serves that purpose. I've named it <em>Memory Sequences</em> which is a term taken from the video game franchise <em>Assassin's Creed</em>. I started making this website on 21st July 2017 and I've documented the making process through out the week. That makes those blogs the first blogs on the website. Althought I will be posting memories before the inception of this website which makes these memories technically older than the first blogs on the website. I've decided to sort the blogs in chronological order. This blog will serve as the description of the purpose and origin of the website.</p><p>This website serves as a means to document my life better, therefore needless to say whatever content is posted on the website is meant to be read by <em>future me</em> and that means most of the gory details and secrets won't be excluded in the blogs. Although I have made this open so anyone interested can read this. Now the type of blogs I will be posting on this website; Actually it's pretty simple, I will be posting anything that is important to me or I'm grateful for, three things mainly-music, philosophical findings and memories. Other topics include skateboarding, books and computer science stuff.</p>",
        "time": "21 July 2017",
        "tags": ["personal", "about"]
    },
    {
        "title": "The Godfather of Skateboarding",
        "content": "<p>There are legends in every craft, crafts in which legends are the ones closest to perfection. But only in rare possibility does it happen that the legend somehow ends up saving the craft from it's demise by evolving the craft itself and making it as big as to be considered a part of mankind's history. The photo below is of <em>Rodney Mullen, the man, the legend, the myth!</em> Do you know? This dude single-handedly invented 270+ skateboard tricks. Tricks from the most basic to impossible (there's even a trick named Impossible), many common modern skate tricks were invented by him, back in 1982. If you can do tricks on a skateboards it is most definite that those tricks were invented by him. He is still alive and well and visits world campionships as a special guest and judge.</p><img src = 'assets/img/big.jpg' width='100%'><p>He even has given a <a href=\"https://www.youtube.com/watch?v=3GVO-MfIl1Q\" target=\"blank\">TED</a> talk. He talked about creativity in general and how he literally created freestyle skateboarding when it seemed skateboarding was taking it's final breaths in the early 1980s. He creatively brought skateboarding from parks and custom-made ramps to the streets. Even the shape of the skateboards was changed from flat to curve at both ends because he invented ollies and curved skateboards made it easier to do it. </p><p>There is much more he did for skateboarding than people know. The contribution which I consider the greatest and most radical was that he gave a platform, a craft to pursue for future skateboarders. He gave skateboarding a rebirth, skateboarding was now done on a totally different terrain and it was made possible by just an ollie! Ollie is when you push your backfoot such that the board jumps from the front while sliding the frontfoot from middle to the front end thus, lifting the whole skateboard. With the invention of ollie skateboards could now jump over curbs and other barriers. Then for easier ollies and it's variantions such as frontside shovit, backside shovit, kickflip, heelflip and other tricks which didn't used ollie such as pop shovit and primo slides, skateboards with curved ends became the mainstream. Afterall this was the skateboard which introduced a complete new dimension to skateboarding, the street!</p>",
        "time": "31 July 2017",
        "tags": ["skateboarding"]
    },
    {
        "title": "MS#2 Building the website: Wireframing?",
        "content": "<p>I was trying to embed spotify player in memories. It's a great idea. I should play with spotify and last.fm apis, there could easily be some features I don't know about. Well, I looked through their apis, nothing interesting to use on this website.</p><p>Listen to this song...</p><div class=\"col-md-6 col-sm-12\"><iframe src=\"https://embed.spotify.com/?uri=spotify%3Atrack%3A6ppPNxdwG8A5Ed8DlNLV6I\" width=\"100%\" height=\"80\" frameborder=\"0\" allowtransparency=\"true\"></iframe></div><p>I accidentally listened to this when Spotify played this after <em>Iron Maiden's</em> playlist finished. Fell in love the moment I heard it. Althought in my experience the songs that I like in the first listen are the songs which seem to fade away quickly. </p><p>Anyways, I am using tinyMCE&nbsp;editor. It's nice because it's producing the final HTML in minified format. I just need a way to automate this process. I should look into the features of this editor. Maybe there's a way to convert the HTML into JSON&nbsp;somehow. That would be so easy for me then. Will have to write extra code for user layer for login, that would require me to study MongoDB. Well, let's see how this goes.</p><p>I got an idea, some implementation of adding notes to memories. Although it would require me to manually add them in data.json file which will be tiresome. We will see about that. I have decided to leave data.json to be my primary and quite frankly the only way to update/add memories. I just need to figure out AWS. It's so fucking confusing. I configured it to run blue/green deployment but my server where not stopping, even when I terminated them manually, new servers kept popping up!</p><p>And this is the reason why you should plan your project properly before starting it. I don't have continous integration or any server to put this project on or the final wireframe of the project. When they say that you should wireframe your project first, I hope they know that most probably there will be major changes to the project in the future. I should have wireframed properly eitherways. Now I need to shift everything from base component to a new component of itself such that I can summon it anywhere in the base component as a part of the it. And similarly make new components as a child of the base component. If I had thought about this earlier then it would have saved much of my time now. So, I guess wireframing is important even though you will have to change most of it in the end.</p>",
        "time": "28 July 2017",
        "tags": ["computer science"]
    },
    {
        "title": "Katatonia + Metal musings",
        "content": "<p>I don't know why people don't take time to explore music. Why do they allow themselves to feed off of <em>Billboard top 100</em>? Or what ever song is trending that week? You won't find influencial music <em>there?</em> The music that will guide you, inspire you, help you, challenge your mind with their clever lyrics and messages hidden between the lines, songs like these won't be present on <em>billboard.</em> Pop culture is death! It's one repetitive, brain-washing, uncreative and destructive genre of music.</p><p><em>\" Was I miserable that I listened to pop music or did listening to pop music made me miserable?\"</em> - Rob, High Fidelity.</p><p>I'm possessed by <em>Iron Maiden</em> well, you can basically say by the whole metal genre. Just found out that <em>Katatonia's</em> new album <em>Fall of the Hearts</em> is getting really good reviews.</p><div class=\"container-fluid col-md-8 col-sm-12\"><iframe src=\"https://embed.spotify.com/?uri=spotify%3Aalbum%3A6LnvGIN1uE1RYJIGhNo9ay\" width=\"100%\" height=\"400\" frameborder=\"0\" allowtransparency=\"true\"></iframe></div><p>I mean I knew it would be worth listening to but this unpreceedented appreciation for the album I'm seeing online is awesome. They are saying that <em>Katatonia</em> has changed their music style for the better. They are more of a progressive metal band. Now Katatonia is blending doom metal and progressive metal. I'm actually really psyched for this genre change, it's like they just <em>progressed</em> towards progressive metal. As I am writing this I feel such an urge to listen to it right now. I mean it's doom + progressive, how could someone knowingly wait for something like that? I am saving the album for the winter. I know that's childish and doing that sometimes turns out to be a bad idea but, it's <em>Katatonia</em>, I'am not going to listen it in the summer.</p><p>When it's bleak outside and every thing is quite, still and cold that will be the time to play <em>Katatonia</em>. Or should I listen to it right now? It won't matter much, i will still be listening to it in the winter. Katatonia is capable enough to create that bleak atmosphere even on a sunny day. Just take <em>In the white</em> for a sample track. From the moment the song begins, right from the first beat the atmosphere around you changes into a bleaker, darker yet welcoming one. The guitars on the songs are just magnificient. This band is one of those bands who are good in every aspect. The guitar, the vocals, the lyrics, the style of delivery, the bass, the rythym and the drums.</p>",
        "time": "4 July 2017",
        "tags": ["music"]
    },
    {
        "title": "MS#3 Web App Update",
        "content": "<p>I want to write about the project as I don't have any strong feeling towards something or any other substancial thing to write about.I have been working on this project for 12 days now. I am happy with what I've built so far. Angular 4 is an awesome framework! It has made the webapp so modular and versatile that each component can co-exist with every other component and together they are forming different states which basically is one of the permutation states. The app seems to run fast and efficient as I don't have any additional modules and libraries lying around. Dead-code has been minimized although Angular 4's <em>tree-shaking</em> would <em>nail the coffin</em>. The aim was to be light-weight, there was no restrictions on the processing power or anything, I made it such, 'cause <em>why not</em>? Although according to <em>Chrome's</em> console the whole app takes 2.3 seconds to load, which is higher than expected. So, I tried running a new project generated via angular-cli and benchmark it. It was taking 1.6 seconds to load the complete seed project. According to that I guess my app is supposed to take 2.3 seconds. I think <em>Spotify</em> is delaying the app. I see the errors for every <em>Spotify</em> player embedded, in the console. Strangers on the Internet are saying that it's some <em>Google Chrome</em> SSL certificate permission termination error. The solution provided didn't worked.</p><p>The webapp is more or less completed, the only things left is the admin layer and search linking. I have found the solution as to how I can make this webapp public and at the same time use it the way I wanted. The idea is to add an admin layer such that all the memories with \"personal\" tag on them will only be shown to me. These personal memories will simply be excluded from the final public JSON object. I will code it tomorrow I guess. The next problem would be to rent a Virtual Private Server. I am afraid in using my Dad's card for paying on services which automatically charge you after your free subscription gets over. I am very lazy and careless at this. I need a company where it's paid monthly or completly free, although the later is hard to find. It just happened to me the other day, I rented a VPS from <em>Amazon</em> and it was fine and working, I even checked <em>blue/green deployment</em>, it all worked. After getting bored off playing with it, I went on to some other project. Four days later, I found, while I was messing with AWS I started four instances and all of them have been continuously since. The free(which is $1) limit was 750hrs and I was doing 940hrs.</p><p>Tomorrow I definitely will score a server. I hope Digital Ocean has <em>Continuous Integration</em>. If I am able to deploy it and pipe it to Github, I can automate the process of updating the content on the website.</p>",
        "time": "2 August 2017",
        "tags": ["computer science"]
    }
]