[
    {
        "content": "<p><em>As the clock struck</em> <em>mid-night</em> I was sitting snuggled deep into my blanket in an upright position in the corner of my room listening to Red Hot Chili Peppers. I came to know it was new year when I heard the celebration. I was feeling good, the feeling of new beginnings kept me in high spirits. I thought at last this could be my break from the surmounting guilt of lost passion, for this would be my year! I will get back to Competitive Programming and practice even harder than the second-half of 2015. I felt like making new year's resolutions, I usually didn't believe in new year's resolutions or any type of resolution, aim or expectation at all, because I had failed at them countless times before. But that night, as I said the forgiving sense of new beginnings had already swept me away, so I gave it another try. Needless to say, I failed miserably but that comes later, will talk about that another time.</p><p>Among other new year's resolution one resolution was to document my life better, I felt there were way too many memories to hold in my head. I kept forgetting them if I didn't think about them in a long time. This fact in actual seriousness is scientifically correct. I made a plan to document my life better, although not knowing how to do it. My music history was being documented by last.fm which was one of the most important among the things to be documented. Another important thing to be documented was memories in the form of stories. This blog serves that purpose. I've named it <em>Memory Sequences</em> which is a term taken from the video game franchise <em>Assassin's Creed</em>. I started making this website on 21st July 2017 and I've documented the making process through out the week. That makes those blogs the first blogs on the website. Although I will be posting memories before the inception of this website which makes these memories technically older than the first blogs on the website. I've decided to sort the blogs in chronological order. This blog will serve as the description of the purpose and origin of the website.</p><p>This website serves as a means to document my life better, therefore needless to say whatever content is posted on the website is meant to be read by <em>future me</em> and that means most of the gory details and secrets won't be excluded from the blogs. Although, I have made this open so anyone interested can read this. Now, the type of blogs I will be posting here; actually, it's pretty simple; I will be posting anything that is important to me or I'm grateful for, three things mainly &mdash; music, philosophical findings, and memories. Other topics include skateboarding, books, and computer science stuff.</p>",
        "tags": [
            "about",
            "new year",
            "resolution",
            "2017"
        ],
        "time": "21 July 2017",
        "title": "MS#1 Realizing New Year's Resolution 2017"
    },
    {
        "content": "<p>There are legends in every craft, crafts in which legends are the ones closest to perfection. But only in rare possibility does it happen that the legend somehow ends up saving the craft from it's demise by evolving the craft itself and making it as big as to be considered a part of mankind's history. The photo below is of <em>Rodney Mullen, the man, the legend, the myth!</em> Do you know? This dude single-handedly invented 270+ skateboard tricks. Tricks from the most basic to impossible (there's even a trick named Impossible invented by him). Many now common skate tricks were invented by him, back in 1982. If you can do tricks on a skateboards it is most definite that those tricks were invented by him. He is still alive and well and visits world campionships as a special guest and judge.</p><img style=\"padding: 10px 0px\" src = 'assets/img/big.jpg' width='100%'><p>He even has given a <a href=\"https://www.youtube.com/watch?v=3GVO-MfIl1Q\" target=\"_blank\" style=\"color: gray\"><u><b>TED</b></u></a> talk. He talked about creativity in general and how he literally created freestyle skateboarding when it seemed skateboarding was taking it's final breaths in the early 1980s. He creatively brought skateboarding from parks and custom-made ramps to the streets. Even the shape of the skateboards was changed from flat to curve at both ends because he invented ollies and curved skateboards made it easier to do it. </p><p>There is much more he did for skateboarding than people know. The contribution which I consider the greatest and most radical was that he gave a platform, a craft to pursue for future skateboarders. He gave skateboarding a rebirth, skateboarding was now done on a totally different terrain and it was made possible by just an ollie! Ollie is when you push your backfoot such that the board jumps from the front while sliding the frontfoot from middle to the front end thus, lifting the whole skateboard. With the invention of ollie skateboards could now jump over curbs and other barriers. Then for easier ollies and it's variantions such as frontside shovit, backside shovit, kickflip, heelflip and other tricks which didn't used ollie such as pop shovit and primo slides, skateboards with curved ends became the mainstream. Afterall this was the skateboard which introduced a complete new dimension to skateboarding, the street!</p>",
        "tags": [
            "skateboarding",
            "interesting people",
            "rodney",
            "mullen"
        ],
        "time": "4 August 2017",
        "title": "Rodney Mullen: The Godfather of Skateboarding"
    },
    {
        "content": "<p>I was trying to embed spotify player in memories. It's a great idea. I should play with spotify and last.fm apis, there could easily be some features I don't know about. Well, I looked through their apis, nothing interesting to use on this website.</p><p>Listen to this song...</p><div class=\"col-md-6 col-sm-12\"><iframe src=\"https://embed.spotify.com/?uri=spotify%3Atrack%3A6ppPNxdwG8A5Ed8DlNLV6I\" width=\"100%\" height=\"80\" frameborder=\"0\" allowtransparency=\"true\"></iframe></div><p>I accidentally listened to this when Spotify played this after <em>Iron Maiden's</em> playlist finished. Fell in love the moment I heard it. Althought in my experience the songs that I like in the first listen are the songs which seem to fade away quickly. </p><p>Anyways, I am using tinyMCE&nbsp;editor. It's nice because it's producing the final HTML in minified format. I just need a way to automate this process. I should look into the features of this editor. Maybe there's a way to convert the HTML into JSON&nbsp;somehow. That would be so easy for me then. Will have to write extra code for user layer for login, that would require me to study MongoDB. Well, let's see how this goes.</p><p>I got an idea, some implementation of adding notes to memories. Although it would require me to manually add them in data.json file which will be tiresome. We will see about that. I have decided to leave data.json to be my primary and quite frankly the only way to update/add memories. I just need to figure out AWS. It's so fucking confusing. I configured it to run blue/green deployment but my server where not stopping, even when I terminated them manually, new servers kept popping up!</p><p>And this is the reason why you should plan your project properly before starting it. I don't have continous integration or any server to put this project on or the final wireframe of the project. When they say that you should wireframe your project first, I hope they know that most probably there will be major changes to the project in the future. I should have wireframed properly eitherways. Now I need to shift everything from base component to a new component of itself such that I can summon it anywhere in the base component as a part of the it. And similarly make new components as a child of the base component. If I had thought about this earlier then it would have saved much of my time now. So, I guess wireframing is important even though you will have to change most of it in the end.</p>",
        "tags": [
            "computer science",
            "development",
            "dio",
            "wireframe"
        ],
        "time": "28 July 2017",
        "title": "MS#3 Building the website: Wireframing?"
    },
    {
        "content": "<p>I don't know why people don't take time to explore music. Why do they allow themselves to feed off of <em>Billboard top 100</em>? Or what ever song is trending that week? You won't find influencial music <em>there?</em> The music that will guide you, inspire you, help you, challenge your mind with their clever lyrics and messages hidden between the lines, songs like these won't be present on <em>billboard.</em> Pop culture is death! It's one repetitive, brain-washing, uncreative and destructive genre of music.</p><p><em>\" Was I miserable that I listened to pop music or did listening to pop music made me miserable?\"</em> - Rob, High Fidelity.</p><p>I'm possessed by <em>Iron Maiden</em> well, you can basically say by the whole metal genre. Just found out that <em>Katatonia's</em> new album <em>Fall of the Hearts</em> is getting really good reviews.</p><div class=\"container-fluid col-md-8 col-sm-12\"><iframe src=\"https://embed.spotify.com/?uri=spotify%3Aalbum%3A6LnvGIN1uE1RYJIGhNo9ay\" width=\"100%\" height=\"400\" frameborder=\"0\" allowtransparency=\"true\"></iframe></div><p>I mean I knew it would be worth listening to but this unpreceedented appreciation for the album I'm seeing online is awesome. They are saying that <em>Katatonia</em> has changed their music style for the better. They are more of a progressive metal band. Now Katatonia is blending doom metal and progressive metal. I'm actually really psyched for this genre change, it's like they just <em>progressed</em> towards progressive metal. As I am writing this I feel such an urge to listen to it right now. I mean it's doom + progressive, how could someone knowingly wait for something like that? I am saving the album for the winter. I know that's childish and doing that sometimes turns out to be a bad idea but, it's <em>Katatonia</em>, I'am not going to listen it in the summer.</p><p>When it's bleak outside and every thing is quite, still and cold that will be the time to play <em>Katatonia</em>. Or should I listen to it right now? It won't matter much, I will still be listening to it in the winter. Katatonia is capable enough to create that bleak atmosphere even on a sunny day. Just take <em>In the white</em> for a sample track. From the moment the song begins, right from the first beat the atmosphere around you changes into a bleaker, darker yet welcoming one. The guitars on the songs are just magnificient. This band is one of those bands who are good in every aspect. The guitar, the vocals, the lyrics, the style of delivery, the bass, the rythym and the drums.</p>",
        "tags": [
            "music",
            "katatonia",
            "metal",
            "rant",
            "doom metal",
            "progressive metal"
        ],
        "time": "4 July 2017",
        "title": "Katatonia + Metal musings"
    },
    {
        "content": "<p>I want to write about the project as I don't have any strong feeling towards something or any other substancial thing to write about.I have been working on this project for 12 days now. I am happy with what I've built so far. Angular 4 is an awesome framework! It has made the webapp so modular and versatile that each component can co-exist with every other component and together they are forming different states which basically is one of the permutation states. The app seems to run fast and efficient as I don't have any additional modules and libraries lying around. Dead-code has been minimized although Angular 4's <em>tree-shaking</em> would <em>nail the coffin</em>. The aim was to be light-weight, there was no restrictions on the processing power or anything, I made it such, 'cause <em>why not</em>? Although according to <em>Chrome's</em> console the whole app takes 2.3 seconds to load, which is higher than expected. So, I tried running a new project generated via angular-cli and benchmark it. It was taking 1.6 seconds to load the complete seed project. According to that I guess my app is supposed to take 2.3 seconds. I think <em>Spotify</em> is delaying the app. I see the errors for every <em>Spotify</em> player embedded, in the console. Strangers on the Internet are saying that it's some <em>Google Chrome</em> SSL certificate permission termination error. The solution provided didn't worked.</p><p>The webapp is more or less completed, the only things left is the admin layer and search linking. I have found the solution as to how I can make this webapp public and at the same time use it the way I wanted. The idea is to add an admin layer such that all the memories with \"personal\" tag on them will only be shown to me. These personal memories will simply be excluded from the final public JSON object. I will code it tomorrow I guess. The next problem would be to rent a Virtual Private Server. I am afraid in using my Dad's card for paying on services which automatically charge you after your free subscription gets over. I am very lazy and careless at this. I need a company where it's paid monthly or completly free, although the later is hard to find. It just happened to me the other day, I rented a VPS from <em>Amazon</em> and it was fine and working, I even checked <em>blue/green deployment</em>, it all worked. After getting bored off playing with it, I went on to some other project. Four days later, I found, while I was messing with AWS I started four instances and all of them have been continuously running since. The free(which is $1) limit was 750hrs and I was doing 940hrs.</p><p>Tomorrow I definitely will score a server. I hope Digital Ocean has <em>Continuous Integration</em>. If I am able to deploy it and pipe it to Github, I can automate the process of updating the content on the website.</p>",
        "tags": [
            "computer science",
            "development",
            "web app update"
        ],
        "time": "2 August 2017",
        "title": "MS#4 Web App Update"
    },
    {
        "content": "​​<p>I was thinking of the content and the type of content I should put here. Not so sure if I am going to make this website private. So I'm going about it my way-right now just think about content which is neutral to everyone, we'll deal with the private/public thing later. I've decided to do a series on \"Interesting People\". There have been some people I have known (not personally) across all domains I'm interested in, whom I have found rather interesting. These people are not necessarily the best in what they do or the most famous in their domains, but there are qualities in each one of them that stand out. I find these people interesting because of two reasons. First, because while watching and really delving into what they did​ ​I had a moment when I was like, \"I too want to be like that\". And second, because these people contributed tremendously towards their respective domains and didn't expect shit in return. You know what's more interesting? Even though these people come from domains which are completely different from one another, all these people b​​ehave, talk, understand and perceive the world exactly the same way. What's even more interesting is that these people despite having completely unrelated crafts in pursuit, all of them have the same goal! To have fun in exploring their craft.</p><p>Well, I'm gonna write about these people the best I can. This will be helpful in future, after all documenting my present thoughts is the goal of this website.</p>",
        "tags": [
            "interesting people",
            "about"
        ],
        "time": "3 August 2017",
        "title": "Interesting People"
    },
    {
        "content": "I can write about it but what's the fucking point?",
        "tags": [
            "nihilism",
            "philosophy",
            "the truth"
        ],
        "time": "4 August 2017",
        "title": "Nihilism"
    },
    {
        "content": "<p>There is no greater turn-off for me in this world other than bullshit. And that's why I consider myself unfortunate living here because all I am surrounded by are the people who are so full of bullshit that even the slightest of eye contact gets me into an ordeal. I am not saying that I am better than those people or anything, I don't consider myself any better when it comes to the big picture. Anyways, I really want to know why people do what they do. They are always brainstorming the best possible outcome of the conversation such that they can benefit from it. If they want something from you, they won't come at you directly, first, they will lay the foundation with their carefully thought-out bull-shittery and then they will slightly hint you about what they want. If you are as experienced as me, you can sense the underlying motive of the conversation right from the first sentence.</p><p>I don't hate people, I don't consider myself better than them and I don't consider myself an introvert so, why does the idea of talking to people seem like such a repulsive chore to me? A very boring and irritating chore to say the least. I can smell even the faintest of bull-shittery even from a mile away. I guess that's why I hate talking to people. I keep to myself and a small group of close friends. What's so polluting about the truth is the thing I can't seem to understand. Why it's so dauntingly repulsive that everyone's rather allowing themselves to feed off of other people's bull-shittery and in return feed them with their own?</p><p>\"<em>Rather than love, than money, than fame, give me truth.</em>\" ― Henry David Thoreau, Walden</p><p>I am sometimes so furious at the morals and values elders preached about, about what is the good and what is bad, about what should be the values one should have, about what life goals one should have, about what success(money) is, about how people through insane hard work achieved their goals and how I should try to do the same. It's all nothing but&nbsp;bullshit. They were all wrong. They allowed themselves to take in the bullshit that other people had so much of. Their brains were corrupted by the insane amount of bullshit it had to deal with. They didn't allow themselves to think on their own. They never had a thought about, \"What if this predefined notion of how human lives should be, is nothing but a hoax?\" These people are not bad people, they are kind and humane, they just have shitty values and beliefs. I noticed a similarity between these elders I am talking about (or you can say the people in general), all of these people didn't achieve shit in their lives, they just kept talking about it, either how they were so close to achieving it or some excuse as to why they weren't able to. I don't believe in achieving but they did, and what happened, in the end, was all of them sitting and preaching thinking they have a lot of experience from life that they can bestow upon younglings.</p><p>\"<em>Behold, how the blind lead each other<br>the philosopher<br>you know so much about nothing at all&nbsp;</em>\" ― Death, The Philosopher</p><p>You see, bullshit doesn't come alone, it comes with all sorts of negative feelings such as jealousy, hate, greed, envy, self-loathing etc. How could you allow those unworthy emotions torment your brain when you could be focusing on doing what makes you happy? Giving time to the things that actually matter. People consider me an anti-social, an introvert, sometimes jerk and a show-off when they try to figure out my behavior towards them and that's good. I am fine with whatever makes them happy and get them off my back.</p>",
        "tags": [
            "bullshit",
            "philosophy",
            "the truth"
        ],
        "time": "4 August 2017",
        "title": "Here's the thing about bullshit"
    },
    {
        "content": "<p>Yesterday I woke up to the moment I won't be forgetting for a long time. It was around 12 in the day when I woke up, I reached out for my laptop to do emails and &nbsp;<em>youtube</em>. Next thing I know I find this news of Chester committing suicide 16hrs ago from LoudWire. Needless to say I spent the next few hours marathoning though their discography. That was the day I cried over someone's death for the first time. He didn't even knew me remotely but I cried because he influenced my life. <em>Linkin&nbsp;Park</em> was the first band I listened to. Their song&nbsp;<em>In the end&nbsp;</em>was the first English&nbsp;song I listened to. Many of my life-turning memories are soaked in their songs. They along with <em>Greenday</em>&nbsp;&amp;<em> Eminem&nbsp;</em>defined the time period from 2007-2013 in my life. Obviously they were important to me.</p><img style=\"padding: 10px 0px\" src=\"http://images.dailyhive.com/20170721155903/chester-bennington-e1500678018162.jpg\" width=\"100%\"><p>I'm listening to them right now, this band made a bonus track for Japan during the tsunami. I don't think I need to say anymore of who they were. So simple, yet so good. I wasn't aware but when you look at them you know they were true, as true the truth can get. That's a bonus point in favor of them. Such a good man, I should try to be that good. If any aim there should be, it should be this. I should blindly follow his beliefs. Althought it's nice to see this much mourning in the world right now, a man like that deserves that level of reverence. Shit!&nbsp;I think I'm going to cry again. It's really good to see that he was a figure whom everyone is paying respect. People from all over the world, the whole rock genre, hollywood. You know you are legendary when people from every cast, religion, country, people who are rich, people who are poor, people you knew you, people who didn't knew, every fucking one, mournes. They wrote a song about Earth, about what we are doing to it. There's no rock band I've known of, who wrote anything about Mother Earth, ever! Why hasn't <em>Greenday</em> dedicated any song to <em>Linkin Park</em> as tribute yet? I'm waiting. Maybe they won't because of some understanding which comes with that level and kind of maturity and experience or they are just dicks in real life. I don't know <em>Greenday</em> from inside, man I should.</p>",
        "tags": [
            "music",
            "philosophical",
            "interesting people"
        ],
        "time": "21 July 2017",
        "title": "MS#2 The day Chester died"
    },
    {
        "content": "<p>I hate tuesdays. All things wrong, insidious and evil happen on tuesdays. On the bright side it's good that all that is evil is compressed into a single day, so rest of the week is fine.</p>",
        "tags": [
            "fuck tuesdays",
            "evil"
        ],
        "time": "23 May 2017",
        "title": "Tuesdays"
    },
    {
        "content": "<p>What is it anyway? Giving a name to oneself on the basis of an act? The way I see it, a single person cannot be called a specific name and cannot be placed into a particular category. It's not this binary. \"Either you are or you're not\", it does not work this way. There's a whole spectrum where you can be placed depending on your indeulgence in the act, whatever it may be. But this contradicts my beliefs. If there is a spectrum and you are a part of it, doesn't matter how basic, even then you are entitled to it.</p><p>Now to think of it I guess my beliefs are contradicted when we take a physical job category. Like a man could be a programmer or not, it's binary. On the other hand if we talk about psychological titles, it's true that one cannot be a certain thing. Suppose calling a man a liar. he lies, but sometimes he speaks the truth and sometimes he lies for a cause. That cause could be defending a truth or  anyone's values, that cause could be futile, that cause could be valuable for the man ot that cause could be greed. And then there are multiple ways to interpret it. Some people would call it a lie, because a lie is a lie, some people would consider it a neccessary lie but then what would you call the man? A lying person or a honest one? The recursion goes on.</p><p>See, it's not binary. There shouldn't be this name-calling.</p>",
        "tags": [
            "philosophical",
            "tags"
        ],
        "time": "5 July 2017",
        "title": "Tags"
    },
    {
        "content": "<p>I consider myself nothing but a human and I posses all the flaws humans are born with. It may feel like a vague statement but when you look into it long and hard you will see that Earthlings consider very highly of themselves. They have forgotten where they came from. I consider human race nothing but a mere coincidence. It's literally a coincidence that a planet formed right in the habitable zone of one of the millions of star system in one of the galaxy among millions galaxies  when big-bang occured.</p><p>As they say, we are  a mere blip in cosmic universe time. We shouldn't consider ourselves more than that. Everyone should strive to survive nothing more than that. There should be no hate, no greed and no lies. But even survival of oneself would provoke hate and vengences due to our flawed judgement. I guess in order to even survive we first should strive to find peace. Living with one another in peace should be our goal. Taking only what's necessary and caring for one's brother should be the life humans should lead.</p><p>But all that is fantasy of the naive. The very nature of human is destructive. we can't live in <em>peace</em>? Our very nature us evil. Look at the state of the world right now. Terrorists being true humans while the other side getting off by pretending how good and important they are. Doing heroic acts just to be the center of attention while not even trying to solve this obvious and predictive state of affairs they call \"problem\". You see? This crave of self-importance which makes humans feel they should matter in this crowd of 7 Billion people, self-importance, yet another flaw deeply rooted in humans.</p><p>You may think I'm a cynical person and you are right, but I like to think that cynism is nothing but the truth we don't want to believe in.</p>",
        "tags": [
            "philosophical",
            "lost path"
        ],
        "time": "5 July 2017",
        "title": "The Lost Path"
    },
    {
        "content": "<p>I've been beating myself over not being productive, not doing what I like the most, being not able to get back to Competitive Programming. Nothing works, I've tried doing several things to shake off this burnout but nothing works!</p><p>There is no good or bad. I'm neither good nor bad. Giving up on your passion should not be considered a downfall. There are reasons for giving up. I'm quantifying it in good and bad because after I stopped training I constantly gave in to weed. That made me think that I'm a bad person for trading the thing I loved the most for a drug. But it was not like that, I understand now. It was not weed that pulled me away from my passion. My passion was long dead. And in trying to revamp the fire(which was imaginary at that point of time), I lost to it everyday for an entire fucking year.</p><div class=\"col-md-6 col-sm-12\"><img style=\"padding: 10px 0px\" src=\"http://i1.wp.com/networkbooks.co.ke/wp-content/uploads/2017/06/dunning-kruger-effect.jpg?resize=660%2C553\" alt=\"Confidence-Knowledge Graph\" width=\"100%\" /></div><p>And because I lost over and over again in trying to \"<em>get back on the wagon</em>\", it pushed me deeper and deeper into the<em> abyss</em> of<em> guilt</em>. Another problem surfaced-\"learned helplessness\".</p>\"Well if I'm not practicing and I pretty much don't like doing anything else then why not get high?\". Getting high is fun, yes! But what it really does is prolong the time when you have to confront the problem. And it doesn't even felt good, when you are so guilt ridden and you realize you passion fading away, all you will ever feel will be every-growing guilt and self-loathing. I got nothing against weed but you should not use it to numb the pain, because guess what? it doesn't . So, basically what it really is, is an excuse to convince yourself-\"Well, I'm high I can't code&nbsp;<em>now!&nbsp;</em>\".<p>But at the end of all this, I see a silver lining. Psychology has started to make sense to me. I understand it better, or it could be the symbol of the cradled over-confidence in me. I could be in that zone. Who knows?</p><p>&nbsp;</p>",
        "tags": [
            "philosophical",
            "personal"
        ],
        "time": "16 July 2017",
        "title": "Lost Passion"
    },
    {
        "content": "<p><strong>Disclaimer</strong>: <em>The following content is really stupid and really&nbsp;long. It has&nbsp;<strong>not</strong>&nbsp;been written under the influence of marijuana.</em></p><p>Don't panic, remember,&nbsp;you guys are already&nbsp;familiar with my kind of&nbsp;stupidity. I just&nbsp;impulsively decided&nbsp;to mail all of you guys at once even though&nbsp;some of you don't even&nbsp;know each&nbsp;other, hehe. I guess it's not that stupid, I mean this is like Christmas postcard kinda thing. Fuck it whatever.</p><p>I have mailed Ajit(2008-present), Akash(2008-present)(<strong>IIT</strong>&nbsp;ISM Dhanbad), pols(2013-present), Balveer(2013-present), Vasu (2010-present,&nbsp;auto correct just made it Vasudev hahaha) &amp; Shubham shahi(2006-present). I wanted to mail this to Siddhant(2007-2017) too but I ain't got his email and on calling him some girl picked up and started bitching about how many wrong number she gets after buying that sim. I seriously believe that dumbfuck ain't&nbsp;even got his mail set up. To all of you who don't know that motherfucker, he is the dumbest dude you will ever meet. But I tend to look on the bright side, it's only because of him that I am never&nbsp;the dumbest person in the room, something Ajit should learn from him,&nbsp;too many active&nbsp;brain cells dude, too many.</p><p>So, why am I writing this?&nbsp;I am committing suicide and I thought you guys should know because&nbsp;you guys are the closest people to me&nbsp;apart from that fucked up family I got. Haha gotcha! I ain't committing suicide, although the format of the suicide letter would be similar. Please don't consider me \"the boy who cried wolf\"&nbsp;after this. This would have&nbsp;definitely turned off shahi, sorry dude. And Ajit &amp; Balveer&nbsp;I know you both&nbsp;would've preferred an&nbsp;audiobook instead but this is what you get&nbsp;just fucking deal with it.</p><p>I am writing this because L comes after K. I accidentally played Katatonia(it's a band) and&nbsp;Katatonia being Katatonia, I just couldn't skip or stop&nbsp;it&nbsp;so I listened to all 23 songs,&nbsp;it reminded me of pols and after that&nbsp;Linkin Park&nbsp;started playing which reminded me of school. I stay clear of that amazing&nbsp;band for nostalgic reasons. Nostalgia is a seductive&nbsp;bitch. I haven't talked to some of you in months which is normal considering its me but it&nbsp;surely shouldn't be this way. There are songs and bands which remind me of each one of&nbsp;you whenever they get played. Ajit with Greenday more specifically Boulevard of broken dreams. Even thought we have spent&nbsp;shit ton of time together&nbsp;after class 10th but class 10th is what I remember vividly.&nbsp;Balveer with&nbsp;Miley Cyrus-we can't stop and not even the&nbsp;original one, we liked the cover Boyce Avenue made.&nbsp;Pols with half&nbsp;of my music library, he likes&nbsp;metal what can I say.&nbsp;Akash(<strong>IIT</strong>&nbsp;ISM Dhanbad) with Hanna Montana(in class 10th I asked him to download her discography, for some reason it just got&nbsp;stuck in my head).&nbsp;Shahi with Skillet,&nbsp;Maroon5 and nfs most wanted songs(remember&nbsp;Kota).&nbsp;Vasu with Eminem(class 12 last bench Eminem-The way I am, we even had lyrics hand-written on paper), I know I've thanked you several times already but really dude&nbsp;<strong>thanks</strong>&nbsp;for recommending Cradle of Filth.&nbsp;</p><p>This is getting touchy&nbsp;and in India people&nbsp;are not supposed to share there feelings but I know how you all are feeling&nbsp;at your new places. Not&nbsp;everyone gets an year back like me and be in the same place they were last year, well,&nbsp;except Vasu. Ajit with&nbsp;Hyderabad,&nbsp;Balveer and pols with&nbsp;Delhi, shahi with I don't know where, actually reply what's up with your life, I don't know shit about you anymore,&nbsp;Akash(<strong>IIT</strong>&nbsp;ISM Dhanbad) with Pune, I know you got a nice job and all but when you told me about your job&nbsp;schedule I was straight-out depressed, actually same with Ajit and Balveer(his is the craziest, even Saturday and Sunday too)&nbsp;too,&nbsp;Vasu same place and Siddhant still leeching off of his parents in Delhi doing nothing.</p><p>Man I've written a&nbsp;shit ton&nbsp;but still no sleep whatsoever. I want to meet you people but I'm so lazy that I haven't even&nbsp;met Siddhant who lives 1.5 hrs away&nbsp;from me, l've kept postponing for almost&nbsp;a year now. According to my level of laziness I won't ever meet Akash(<strong>IIT</strong>&nbsp;ISM Dhanbad)(now&nbsp;Pune)&nbsp;again&nbsp;as his family even shifted from gkp&nbsp;to Varanasi.</p><p>I don't know when will I meet Shahi,&nbsp;Vasu and Akash(<strong>IIT</strong>&nbsp;ISM Dhanbad) but I swear this week I will go visit Balveer, pols and Siddhant (actually I have to get my laptop battery replaced).&nbsp;And as per you&nbsp;Ajit I just don't worry about meeting you, I don't know why, we will be fine. Yeah,&nbsp;now&nbsp;this seems like a good ending. I swear next time you all get this type of mail, it will be a&nbsp;suicide note cause who uses paper anymore, it's 2017!</p>",
        "tags": [
            "personal",
            "letter"
        ],
        "time": "18 July 2017",
        "title": "A letter to 7 of my close friends"
    },
    {
        "content": "<p>Memory Sequences is almost complete, one more day might do it. I am currently well-versed in Angular4 + Typescript and I have 3 more web apps to make using this framework which is good but I want to make apps using GoLang&nbsp;and Ionic Framework as well. I am thinking of giving ReactJs a run too. People are saying it's light-weight and easy to learn. It's going head-to-head against Angular4, it has to be good. But then I also want to explore&nbsp;C++'s development side by making a project. And if I'm doing C++ then I might as well make games. That would check another thing off the bucket-list. Although&nbsp;I want to get in machine learning too, I've never paid much attention to it in the past but it seems that's where the future's headed. That makes 5 completely(more or less) new domains to be learned by me in the next 9 months. It would feel overwhelming if I make a schedule to do all these projects. Schedules never work with me any ways. I'm not going to stress over completing all of these but right now I want to do something new and that's why I need to decide on something soon.</p><p>\"<em><strong>Hofstadter's Law:</strong> It always takes longer than you expect, <br />even when you take into account Hofstadter's Law</em>.\"&nbsp;&mdash;&nbsp;Douglas Hofstadter</p><p>It is probable that I won't complete all of these in time so, I have decided to divide them on the basis of urgency of the projects a&nbsp;short-term goal and a long-term goal. Skills in short-term goal are those which I need for mediocre jobs most probably in a start-up, keeping myself on the forefront of technology will help here. For completing short-term goals I think I should continue doing web dev and try learning the obscure parts such as RxJs, ReactJs, make software I need to automate my life thus, encouraging my sloth behavior and eventually taking me to the next level of laziness. Similarly for long-term goal i.e aiming for a job in really good startup most probably abroad. Getting sponsored for a visa is getting harder, although it's relatively easier for developers. Some European countries have a special job skills which a migrant can have, fortunately, software engineering related skills are the ones most in demand. For these startups and companies, I will require having a wider knowledge in computer science. I come from an algorithm(C++) background so I can say a huge &amp; a fairly difficult part is already covered. Game development in C++ would teach me the other side of the language the Object Oriented Programming side. I need to learn machine learning as well. It seems really fun. Actually, I don't know shit about machine learning, I ain't got anything else to write about it other than that the projects are in a different dimension and I really want to try it. I think all this would enstate me as a programmer with fairly balanced knowledge in computer science. According to me and quote me on this, \"becoming a jack of all trades and master of none seems fruitful in software development.\"</p><p>I was of bored of programming so I decided to think and write about the technologies I should learn next. Making plans is so stupid but I still did it. Just like millions times before this plan will also fail, I will complete them if they stay fun otherwise I will give up, I'm not going to stress over them. Actually you can't call this a full-fledged plan. There's a deadline but I won't care much if I crossed it and I haven't even decided the order of the project. I just wanted to layout my interests and decide which one to do first.</p>",
        "tags": [
            "computer science",
            "development"
        ],
        "time": "7 August 2017",
        "title": "MS#5 Do or do not, there is no try"
    },
    {
        "content": "<ul><li>I want to write something but I think I won't be able to phrase is as good as it should be because I am high. Now the question which arises in my mind is&mdash;\"is writing cleverly and in a quality exuding way, important?\" Isn't the aim of journals and diaries just to store memories? Yes, I agree that writing in a well-structured way is more preferable but at the same time writing shouldn't be stopped just because one thinks that the quality won't be at par.</li><li>When you can't decide which band to play, just let <b>SLAYER</b> decide.</li><li>The earliest memory I can recall is from around 1997, which means I have a memory which is 20 years old, I am 22 right now. I don't know it's facinating to me.</li><li>I think people fail not because they spend most of their time doing other things, they fail because they spend less time in doing what they want to excel in.</li><li>Rule of Thumb #1 &mdash; You know when you think if other people ever thought what you think. Those weird, unspeakable, sometimes simple everyday things? Just know all humans are same, everyone's as fucked up as you.</li><li>I rarely get angry at anything these days. But one thing that still makes me angry is war. It has proven to be pointless countless times already. Those organizations that brainwashes masses through religion are the ones who they should take out first. It always comes down to religion. Beliefs can have permanent effect on you.</li><li>There was a thing i was thinking hich was really really profound. I can't recall it now. I'm mourning over it.</li></ul>",
        "tags": [
            "personal",
            "high thoughts",
            "catalogue",
            "weed thoughts"
        ],
        "time": "8 August 2017",
        "title": "High Thought Catalogue"
    },
    {
        "content": "<p>This past week my writing has been to a minimum. I don't exactly know why. Is it because of the website? Because I am not comfortable enough with the security of my personal blogs? Or is it because writing on a keyboard hasn't yet made itself completely familiar to me? Most probably it's nothing, it was like this because I didn't make the personal filter and because of that storing the data was time-takingly painful. I am again headed to the place where I was headed back in May. The funny thing is that it made the <em>new me</em> (I know these words have a touch of naiveness and are filled with ego but I can't think of any replacement right now) scared for a moment. I think much more is going on than I know, psychologically speaking. Fuck this! I'm not gonna care if these logs are poorly written.</p><p>I should get in a habit of writing my thoughts down before they fly away, I tell you, some of them are amazingly profound that in some sense I know immediately that I won't reach this conclusion ever again in my life, this should be written right now and here! I think my behavior is changing to <em>Hunter S. Thompson's</em>. I am really interested to know more about him as I find him someone that has been to places only few have treaded to. Therefore he would have the answers to my questions. I thought I was done with questions and that's why it's really important to keep in mind that I gave up on trying, I didn't gave up on my interests. It's just a phase I guess, you know, the immitation you do when you are completely polarized by someone. Although I won't mind if I started living on his principles and acting the way he did. Actually that's what I want, this is the first time I've found a balance between programming and drugs. A balance which still needs improvement but a working one nonetheless. Living on Hunter S. Thompson's principles would actually make me better at my craft. He is one of the <em>interesting people</em> I will write about soon. I just realized the title of this blog is \"Life Update\" and I haven't written shit on it yet. Programming is going slow these days. I am not able to write enough code these days because this weed is making me such a sloth. I don't feel like programming because of it. Even the aim of the day is not a lucrative one&mdash;<em>fix the login layer and try to find a way to map tags to searched string</em>. I want something more interesting than this. Actually these objectives mark the end of the project. I guess what's going on is my ignorance towards <em>almost</em> completed jobs. I do this when the job is more or less completed (but still incomplete) to the point where it can be practically said that it's completed. There's a model which is up and running in all it's glory but the luxury features are pending. The problem with this is that I leave the job incomplete and when I need them in future to show or use it in another project, I will have to complete it, but by then the technology in which it's written would have already aged like a motherfucker and I won't have any choice other than setting the project aside. I don't care much if I set myself straight but I recommend I should, it will save a lot of time in the future. I should start something hard. Game programming I guess. I want to be sober now. I want my brain to function normally. I want to feel the high of making new shit, music and writing. I need to get out of this room more frequently. College could be an option, there's food too. Well, it's only 4hrs, it can be done.</p><p>I need to write about the whole giving up thing. After I gave up pretty much everything inside my head changed. I keep thinking about a topic to write about, a topic which I have already written in the notebooks. But, whatever's there in the notebook is pre-giving up. So most of the things I wrote are the things I don't believe in now. I guess I should exclude everything pre-giving up. But to think&mdash;\"not logging most of my mistakes could be a mistake\" is something I can't overlook. I guess I will be adding few older blogs here and there afterall!</p>",
        "tags": [
            "personal",
            "life update",
            "Hunter S. Thompson"
        ],
        "time": "8 August 2017",
        "title": "MS#6 Life Update"
    },
    {
        "content": "<p>The days are passing by so fast. It's already August. I don't know, whenever I get high, I feel like programming. These days programming is the only thing I am interested in. I am not attracted to music, movies, shows or youtube. I keep programming day and night because it's the only thing that keeps me from getting bored. It has sometimes felt a little too weird, I keep remembering Alan Wake video game in which the ghost was repulsive to light. So, many a time in the game&nbsp;we have to run to a light-post before the ghost gets us. In my&nbsp;case, the ghost is boredom and the light-post is programming. I am not sure if this weird habit of mine is improving me or not, but I'm sure programming a lot. Although I feel I am slow, which is easily predictive. I don't know how to feel about my situation. I am programming but my life is in complete disarray, I'm high all the time, I can't think straight, I can't read books, I don't feel like listening to music. I guess this has to end. I code when I'm not high as well. It's even more effective and efficient than now.</p><p>I'm not able to decide on what should I do with <a href=\"http://139.59.38.41/tms\" target=\"_blank\" style=\"color: gray\"><u><b>time my show</b></u></a>, I have a new design in mind but that requires me to completely redo the whole design. And even then the website won't be responsive. I need to learn how to make custom responsive web sites. See, I am learning, don't think this all is just a waste of time. I need to learn passing values as services as well and storing the data in local storage and sessions.</p><p>Life is going the way I wanted it to, but still I'm not satisfied. I just wanted to float away and not mind the disturbance, and that's what's happening. But I am still not satisfied. Well, this conclusion was obvious, human's biggest dilema&mdash;never being satisfied, obviously applies to me as well. I can't outrun this. I am really confused as to how I should start with C++ project, or should I first do the golang project. This phase is the slowest, most boring and undesirable one. The first phase, when the obvious path is yet to reveal itself. I've mailed both of my abroad contacts asking what should I do next. If they can help me anyhow, I will take it. I need to leave this country fast. I am an above-average developer in world perspective. I won't put myself in good-developer category, above-average seems like a fine estimation. I have knowledge of algorithms and data structures, NodeJs/Angular development, shit-ton of projects and some designing sense. I shouldn't find it difficult to find a good job. Actually I am not fretting the end of college, I am afraid of purposeless life after college. Right now I have time to do whatever comes to my mind but after college is over I won't have time to do shit. I won't have the whole day to myself, there will be restrictions. I will have to go to job every fucking day. You remember the internship days, right? It will be hell. I need to have a plan right now. Sometimes I think of freelancing but that's not satisfying work. Doing a job is the only choice I have, I guess, considering my laziness. Well, if I am going to have a job I might as well do everything I can to soften the blow. I should really research what type of programming should I get into next. I need to improve as much as I can, it will increase the chances of me getting not a shitty job and with not so irritating programmers.</p>",
        "tags": [
            "boredom",
            "blurry days"
        ],
        "time": "9 August 2017",
        "title": "MS#7 Blurry Days"
    },
    {
        "content": "<p title=\"Fuck India\">Up until yesterday, I didn't ever think about how it would be like if I continue living in india and don't try getting out of this shit-hole after college. I always said I would leave this Country and never come back, but that was when leaving was a thing of the far-future. Believe me, it wasn't until yesterday that I felt the horror of what would my life be if I stay in this cum-dumpster. I came to think this when I had a talk with my uncle from Sweden yesterday. He told me that there's no way any company is going to sponsor a visa, as they sponsor only a very few elites from IITs. It's getting harder and harder to get a visa, therefore the only way for me to get out of this country is to do MS. But MS costs around ₹30,00,000 without a scholarship, which makes MS an absolute \"no\". In order to get a scholarship, I need to perform well in GRE (which is not a big problem) and also have decent grades in bachelors (which is the biggest problem). So scholarship is more or less out of the window. Being discouraged, I for the first time actually thought of living <em>here</em>.</p><p  title=\"All hail Norway!!\">I hate india, I hate everything it has to offer. It's full of shitty people and each and everything I like is frowned upon by them. I don't want to live in a place where I don't fit in. By this time I was hoping to find a silver lining to all this. Enter Norway, the best Country anyone could go to do MS! Norway has the best government, actually I don't have any political stance on any Country, I just consider Norway's government the best because all type of education provided in Norway is completely free! Schools and universities run on tax-payers money. Norway is the only hope for me right now. Living costs are high, but I could do a minimum wage job or something to cover that, it is allowed to work 20hrs/week for a student and full-time on holidays, or if it's still turning to be high I am ready to take a loan from my Dad or student loan from a bank. The only hiccup I found was to find an apartment. People are telling apartments are really hard to find but I am desperate enough to live anywhere. I am a little too low-maintenance, apartment is a non-issue.</p><p  title=\"Tru-kvlt\">I don't think fitting-in would be a problem. It would be easy to find people like me. After all some of the music I listen to originated from Norway. Many bands whom I listen to and like are from Norway&mdash;Satyricon, Dimmu Borgir, Mayhem, Emperor, Immortal, Darkthrone. They even have a sub-genre of metal named after them&mdash;Norwegian black metal. I don't need to tell you further on how much at-home I would feel there. You see it's bigger than music, the type of music I listen to, appeals only to people with certain mindsets&mdash;mindsets like mine, I am after those people. I can't wait to get out of this religion brainwashed country and go be a part of an actual culture that I like. I want to go home.</p><p><em>\"Mother North<br>United we stand (together we walk)<br>Phantom North<br>I'll be there when you hunt them down\"</em>&nbsp;&mdash;Satyricon, Mother North<br>(Mother North serves as somewhat of a black metal national anthem for Norway.)<br></p><p>You must be thinking how ignorant and arrogant prick I am and it's my fault for making you think like that. Believe me, I am not one of those people who pick out mistakes in everything. My only problem is with this country, the people in this country to be specific. Other than that I live a pretty happy life! You can say that my only aim other than leaving this shit-hole of a country is to wake up everyday and do EXACTLY what I feel like, do those things the whole day and go to sleep. And I achieve my aim every single day! Actually, I just get bored to death and start programming, the only thing I've liked through the years apart from metal and one piece. I am completey happy and satisfied with my life in solitude.</p>",
        "tags": [
            "horror",
            "norway",
            "fuck india",
            "home",
            "ms",
            "metal"
        ],
        "time": "13 August 2017",
        "title": "The Ultimate Horror"
    },
    {
        "content": "<p>I was out on a trip to Mcleaodganj (2130m) which included a 9 km trek to Triund (2850m). I am not going to write about the details of the trip but about a weird thing I am feeling for 7-8 months now and how I found it harmless. The feeling's like I am watching and interacting with the world in 3rd person. Just peacfully floating away, relaxed all the time, spinning thoughts in my head completely secluded from the outside world. I was feeling like this when I was surrounded by nothing but trees, clouds and deafening silence. No rustling leaves, no birds chirping. Like the forest was fast asleep in the cold. This was the atmosphere I was longing for years. The bleakness was intense and I was enjoying solitude, but felt like I was experiencing it in 3rd person. It's like I can control the body and make it do things I won't do in <em>real life</em>, I am easily able to face my phobias without a hint of fear for I believe the body is not the real me, it's just a puppet, whatever happens it won't effect the state of mind I am presently deeply entrenched into, I am safe. I was knee deep in grass far away from any road in wilderness and I fear snakes! But I had no second thoughts when I had to cross several mountains and valleys. And because of that feeling I found myself sitting amidst the trees with clouds blurring the distant ones creating a bleak atmosphere yet feeling bad for not being able to absorb the atmosphere enough. Deviated by other thoughts, thoughts I had categorized as not qualified enough to give my precious time in solitude to.</p><p><strong>Sidenote: </strong>I need to take a solo trek, I want to be completely alone. If I was not lazy enough to make a bucket list, one thing I would certainly add would be to scream at the top of my voice for as long as I want and scream whatever words I feel like without being heard by anyone. For me it brings a feeling of absolute freedom.</p><p>I was convinced I was not thinking the things I should. The answer to this I came up with was to just let go, don't try. And finally when I was sitting on a mounted rock 8 ft tall, inclined towards the valley followed by the vast Dauladhar range in the morning waiting for sun to peek from behind the mountain as the invisible city beneath the clouds I couldn't see when I looked down at the clouds still lying in shade, I had a comforting conversation with the mountain in front of me. Like a reflection of the nature itself standing in front of me as I was asking for answers to my own nature from the lofty mountain. Why are humans so flawed? Why are we not pure like you? Should humans not be considered a part of nature anymore? For I want to be as silent as you, be as welcoming and even relentless as you, be around you more often. Was the old woman scaling the mountain, leaving her home for another 2 months for grazing someone elses cow after being only 3 days at home not happy? No, she was happy. It was her job, she was content with what she had. She accepted the fact that she is not strong like she used to be and now she jokes about how slow paced she was. These are the people I want to be around, people who actually know themselves and are satisfied with life.</p><p>I was wrong! This feeling of not being able to actually interact with the world had no effect on how I felt. The feeling were still there, true and pure.</p>",
        "tags": [
            "trek",
            "triund",
            "personal",
            "hike",
            "nature"
        ],
        "time": "22 August 2017",
        "title": "Being wrong and feeling good about it"
    },
    {
        "content": "<p>I've been observing this tendency of mine to incline towards the choice which majority of the population would decline. I am always attracted towards the things most people consider bad, useless or wrong. I always try to make myself different from the others, to stand out, a thing which I consider I am acually successful in. And through repetitive re-programming of my brain now I involuntarily choose the road less travelled, always.</p><p>Is it me just proof-checking the legitimacy of the claim? Or is it the method I am using subconsiously to make myself feel special? Or is it that I used to do it in childhood and it's just a habit now? I don't know. I know it's not good whatever reason is. I should incline towards my beliefs not towards what's more stimulating.</p><p>\"Ideas that fall under shadows of theories that stand tall<br>Thoughts that grow narrow upon being verbally released<br>Your mind is not your own,<br>What sounds more mentally stimulating is how you make your choice\" &mdash; <b>Death, The Philosopher</b></p><p>But I believe my assets exist because of this behaviour of mine. By repetitively choosing the <em>less favored side</em> I found one of the two things. First, that was an actual bad decision and I shouldn't choose it again. Second, it was a good decision for me and it fits me well. Although it's a bad choice for most, I understand why and I choose to go with it even though it is frowned upon. And I think that's how I became <em>different</em>.<br><strong>Sidenote:</strong> I said \"different\", not \"better\" than others. One can easily sound egoistic in his philosophies.</p><p>It does good to me but if I am choosing wrong I will surely pay for it one day. The further that day is the more I will pay.</p>",
        "tags": [
            "road less travelled",
            "philosophy"
        ],
        "time": "23 August 2017",
        "title": "A sucker for the road less travelled"
    },
    {
        "content": "<p>I've started building the next project, \"Empire of the clouds\", I named it after one of the most iconic song from Iron Maiden, an absolute eighteen minute marvel. The song is about the legendary airship R101, I went with this name because this webapp is music based and the whole point of this webapp is to store everything on the cloud, considering my music collection an <em>empire</em>. Anyways, I'm writing in typescript and using angular 4, for the last time I swear. Actually, I guess I will make one desktop app for windows and Linux using angular 4, nodejs and electron.</p><p>I am so psyched to start making this one. I'm finally doing something for improving my music library's accessibility and portability. I'm curently listening to non-metal songs on a webapp made by some young programmer. I feel such freedom using this app. All I need is internet and my google drive password and I'll have access to my music. My carefully hand-picked music and playlists all in 320kbps. Time and again I am forgetting where the music is playing from. When I'm realizing it's from the webapp, and that there's no relation to local storage or this computer, it's making me feel so secure and free.</p><p>I've wireframed the app and written all the features I need in two parts: essential and luxury features. It would be hard to build this one. I don't know most of the concepts this app would require. </p><img style=\"padding: 10px 0px\" src = 'https://hmu6bg.bn1301.livefilestore.com/y4mZOoLRylqNFJoe-4ilheJJltn-DXvicuOeM0irpTnZNyzDAEBO-i859v67wfxE3dPIW3rnmg2oy33RlrOGQMzbyqYDRv_Rejla0whrqoNI9Inw6Np4UDZYhUlW2-E_f70VqGm0ppo7kZ8MT8k6pE5_nknSUCyYe1yCyQJdxskc6lkf1Z_EozWwZDdfqIfiOg67rQ81Qim8F1Kz5WhzovvfQ?width=1024&height=765&cropmode=none' width='100%'><p>Well, I made Memory Sequence in angular 4 and typescript when not knowing shit about them. Making this one requires really good knowledge of the framework. I don't know if I will be able to complete it but I will try. </p><p>The webapp I'm using is doing it's job fine but I need way more features. I want to custom make the software for myself. Make it work exactly the way I want and when I want. Also this app doesn't feel my type, there's no surprise and the design is crappy. I won't feel complete freedom unless I use the things I wrote and can control. I am thinking of parsing artist data from last.fm rather than linking to last.fm's page. This would make it lengthy but better.</p><p>In a nutshell I just need to implement Google auth and then further figure out the api to implement drive methods, once able to receive from drive I need to make a player and search for how to play audio using typescript then I will have to make the directory in tree structure in the sidebar so that I can drag and drop the artist I want to play and btw I need to implement drag and drop too, once the player is running using the songs from google drive I need to implement last.fm apis and make pages for artists i.e content, inside content component 3 types of pages would open song list, artist info and last.fm stats for the artist and last but surely not the least, completely redesign the app for mobile because it needs to look completely different and auto-responsiveness won't work.</p><p>And if I want luxury features too, then add yet another paragraph like that.</p>",
        "tags": [
            "web dev",
            "empire of the clouds",
            "computer science"
        ],
        "time": "27 August 2017",
        "title": "Empire of the clouds #1"
    },
    {
        "content": "<p>These days when I am high all the time, I don't have any thoughts other than of programming. That, Age of Empire 2 and Metal has kept me from perishing. I have no worries what so ever right now. Maybe a little about Norway and job but other than that it's a smooth sail for me. I am currently more into travelling. I want to go places more often. Actually I should search places nearby like clear water river or lake or forest or anything. There are many destinations to go to, I will ask him to come with me. I don't know where to go but where ever it may be there should be water, like river or pond. The place I want to go are the foothills of Himalayas in Nepal.</p><p>I really need to think about things such as GRE and job. I also can't wait to make an app for linux. I don't know if I should complete Empire of the Clouds first or just jump into this desktop app project. I've always wanted to write for linux and now I can and what's even better is that I can use Angular and NodeJs. But the problem here is that I don't have any idea for a desktop app that I would need. There's netcut remake with more stability and clarity and less advertisment. But I am not sure if I will be able to make it. It looks hard because there's shit load of nmap stuff.</p><p><strong>Yesterday's random:</strong> And if I feel like giving up, I will. I got no problem with that. I know I freak people with my philosophies, some have shared how they feel listening to my theories. Don't worry I am just trying to do what works with me. And it's to stop trying, give up on trying to do each and everything. It works for me. Actually, I get bored and desperately return to progamming because that's the only thing I like. This is why this weird philosophy I'm using, works. And now I'm jamming to Taylor Swift, and people say I only like Metal. I guess I will have to make this blog personal too. I'm writing weird things. It's Taylor Swift&mdash;You Belong With Me, it reminds me of my sister. Man, I just want to be in regular contact with her.</p><p><strong>11th sept 2017</strong> &mdash; I went through that fucked up time only because I was too stupid to think. Wanna know a fun fact? I was accused of killing my friend in class 2nd and everyone continued to believed that even after I presented my alibi, I was with other friend when that huge log fell on him. It was most probably an accident and on top of that why the fuck was there a log the size of a room on school premises. It was some serious shit. School was guilty obviously but they pressured me into saying that I was with him at the time, the log fell and I did nothing about it, just walked away and he died of blood loss. You fucking kidding me? I would do nothing if my friend was under a log? The friend I traded pokemon cards with (that was the pinnacle of friendship for 8 year old boys at that time), I wouldn't care about him? You would have to be really fucked up in the brain to be able to do the thing they accused me of doing. Anyways, the point is that I was accused of murder and I still didn't spoke up. I was in class 2nd though. I don't know, it still counts. I could have atleast told my parents. Yeah, I didn't even told them about it. They are still confused about this. They don't want to believe it and they think they will never know the truth because everytime you confront a thief, he would say he's guilty. You see the point up to which I took this? Wtf! This blog just took an unexpected turn.</p>",
        "tags": [
            "filtered thoughts",
            "personal"
        ],
        "time": "28 August 2017",
        "title": "Filtered thoughts"
    },
    {
        "content": "<p>So, you know the truth right? That everything is pointless, that we don't matter, that nothing anyone has ever done matters. And nothing lasts forever so, one day our race will perish and the universe would go on like nothing happened. Actually for universe our extinction literally won't matter. Humans have the tendency to romaticize themselves as important beings, that there's purpose to our lives, that we're born for a reason. Nobody is born for any fucking reason. Humans are the same as other animals and plants. It's just that we have a more developed (yet flawed) brain. We are all programmed by our culture to believe that every single child is important and special. The fact that everyone is important directly means nobody is important is completely oblivious to people, I don't know how. I am talking about the sense of self-importance. I said \"sense\" because it's so deeply entrenced in us that we might as well consider it a sense now. It creeps up on you when it's receptors get ego hurt. Just like any other animal or plant, we don't matter either, no matter how developed our brains are we are not fucking special. We got intelligence and through that technology, we can escape our demise, you say? Our species won't be able to answer the identity of the universe ever. We won't ever reach that far.</p><p>\"Eternal blackness beyond the stars<br>we think our wisdom won't get that far\" &mdash; <strong>Iron Maiden, If Eternity Should Fail</strong></p><p>I think I've figured why no one's addressing the elephant in the room and still looking for answers to our existence from souls and spirits. The very nature of human is figuring out the reason behind any cause. We always look for answers and try to figure out the reason, in each and everything. While the whole point of our existence doesn't have any reason other than that a meteorite hit the earth hence commencing evolution. We started fanticizing about souls and spirits and I guess that's how religion was born. Some clever dude figured out the emotional longings of human, the crave for closure and control and fed us lies, about god, that there is a greater being watching over us, that he cares about us, that we are all his children thus, exploiting our weakness, self-importance. This lie was gullable for humans. I guess that's why religion is so prominent, it makes each one of us feel special in the eye of god.<p>\"The pestilence of Jesus Christ<br>There never was a sacrifice<br>No man who hung the crucifix<br>Beware the call for purity<br>Infections their facility<br>I've made my choice, 666!\" &mdash; <strong>Slayer, Cult</strong></p>But humans still try to figure out the reason they were born for, their destiny, the grand plan universe had laid out for them. Nobody's finding that shit 'cause it doesn't exist. Humans search for answers while the sheer simplicity of the fact is that there's no explanation, and that drives them insane. It's because they are wired to search and successfully find complete logical answers to make them feel they're in control. That's why I think most people subconsiously neglect the truth and keep themselves seduced by the thing they call \"life\".</p><p>They seem stupid, right? Afterall, they are searching for something that's right in front of them. No, they are actually not stupid at all. Because you see, that's the point of existence, nothing matters! That's our contract with the universe. There's no good, bad, right, wrong, clever, stupid, lie or truth. It's all in our head, hence in our society. The thing we call life is a mere castle in the air, there's absolutely nothing, nothing at all, but us (animals), plants and rocks, whole lotta rocks. And in reality, in the eyes of the universe we are nothing different from those rocks. We are <a href=\"https://www.youtube.com/watch?v=M8V_glRW1hA\" target=\"_blank\" style=\"color: gray\"><u><b>insignificant</b></u></a>.</p><img style=\"padding: 10px 0px\" src = 'https://nyoobserver.files.wordpress.com/2015/10/voyager2.png' width='100%'><p>\"We were nothing... for a billion years before our time<br>And we will be... nothing more again, for an eternity yet to come\" &mdash; <strong>Woods of Ypres, Death is not an Exit</strong></p><p>So, how do I live? What should I do until the time I've to confront the final truth, death? According to my philosophy, do absolutely anything you want! Do the most insignificant of things, it would be the same as doing the most <em>significant</em> thing you could possibly do. Because you see, nothing matters. There's a sense of freedom you would feel if you understand the philosophy. Because this literally means that you are free! There's freedom associated in knowing that we are powerless against time and universe, we might as well spend our lives doing what we love no matter how insignificant. What I'm implying is do basket weaving, spend major portion of your day weaving, day after day or be a rocket engineer, work for NASA or SpaceX, contribute in making humans interplanetary. Your time is well spent on doing either of those things and both are actually equally significant, insignificant.</p>“Whatever you do in life will be insignificant, but it is very important that you do it.” &mdash; <strong>Mahatma Gandhi</strong>",
        "tags": [
            "the truth",
            "philosophy",
            "freedom"
        ],
        "time": "28 August 2017",
        "title": "The Truth"
    },
    {
        "content": "<p>What is this human tendency to always long for a better future. Always feeling optimistic about the future after every defeat and failure. People are even encouraged to do so. But is it really necessary? And more importantly, does it work?</p><p>According to urban dictionary: \"nostalgia is reminiscent of a time when the world ceased to move around you because you had it all.\" The light you see when you are faced with failure, the optimism, it's the exact opposite of nostalgia yet the same in some regards. Nostalgia works on past experiences and memories while optimism works on future goals and expectations. That's the only difference I see between these two. Apart from that every other trait is fairly similar. You feel good after thinking, whether it be past or future, nostalgia or optimism respectively sweeps you away, seduces you to think, \"those were the days, the good days, the time of my life.\" or \"it's all going to be okay, everything is going to be okay, just be positive.\" Nostalgia is much of a studied subject and the conclusion they came to was that it's a seductive lying bitch. Nostalgia make you think that the past was good. It reminds you only of the good moments you had carefully excluding the gory details. For instance, sometimes I think, \"Man, school days were the days. I had all my friends with me and we did some crazy things. I want those good old days back.\" But you see, nostalgia excluded the things such as how insecure, unconfident and miserable I was in school. I was in a relationship that almost literally drove me crazy. Actually, the most infuriating pain I've ever felt in my life was in that relationship in school. No other pain has ever came close to that one, physical or mental. That's what nostalgia doesn't tell you.</p><p>The story is same with optimism. Although, it's not a much studied subject like nostalgia. According to me both are similar therefore, we can try applying the traits of nostalgia to optimism. In optimism we think about the future, here we think how our lives could be better than present. Even when we are presented with soul crushing failure after failure, there's something that tells us that it will get better. A day will come when everything will be good with no pain, remorse or worries. But you see that rarely happens, sometimes things fall and become even shittier. You feel the pain of failure again and yet again you hope for things to get better, hope for that day you longed for, to arrive. There's no fault in this. Afterall, you are just trying again and again until you reach success, isn't that what success requires, persistence?</p><p>But I think there's a better way to go about these things. First, know that optimism is fake. It's just a coping mechanism your mind comes up with to soften the blow from your devastating repetitive failure. It builds up your expectations about yourself on how you should perform next time. This in turn makes you feel paranoid when you see you are not productive enough. You feel like you have to do more in order to be at par with your expectations. You start forcing yourself to be productive day after day, but all that does is that it makes the job you once felt passionate about, a chore. You start to despise it which in turn makes you even less productive and more miserable. And yet again your mind makes you think, \"No, I can't give up. I just need to push harder, just like every successful man ever said.\" You see it's a vicious circle you got yourself into. Yes, there's a probability that you might succeed, but is it necessary to torture yourself over the thing you could do without?</p>",
        "tags": [
            "illusion",
            "nostalgia",
            "optimism",
            "don't try"
        ],
        "time": "3 September 2017",
        "title": "Nostalgia and optimism"
    },
    {
        "content": "<p>I'm not sure if I should write this one as I don't remember dates before 2011. But if I don't then I will curse myself in 2023, thinking I don't clearly remember the dates around 2017!</p><strong>2nd March 2010: </strong>My birthday, a tuesday, all shops in Sahara States closed, walked to a nearby place through a wasteland and got dairymilk with Ajit.<br><strong>26th January 2011: </strong>Proposed to Yashi and Akash's birthday.<br><strong>2nd February: </strong>She accepted and Shubham Shahi's birthday.<br><strong>2nd March 2011: </strong>My first phone sex and my birthday.<br><strong>15th May 2011: </strong>Yashi came to my house, we studied <em>hybridization.</em><br><strong>19th May 2011: </strong>Went to see \"Ragini MMS\".<br><strong>20th May 2011: </strong>School break for summer vacation, bus no. 4 was behind bus no. 2, got chicken pox.<br><strong>4th June 2011: </strong>Found out she was in a relationship with another dude for around a year. Broken.<br><strong>10th July 2011: </strong>I gave her the note and eventually got back together. Ajit asked me why was I continuously smiling.<br><strong>30th October 2011: </strong>Lost my virginity to Yashi and my brother's birthday.<br><strong>13th November 2011: </strong>Got into an accident, bled but not that serious.<br><strong>17th November 2011: </strong>Wasn't recovered from the accident but still had sex. It hurt.<br><strong>2nd March 2012: </strong>I and Yashi went for a long walk  while eating chicken rolls in school uniform.<br><strong>11th May 2012: </strong>She called me at 5am to let me know she was on her way to Lucknow, I was playing Batman: Arkham City, it was awesome!<br><strong>21st May 2012: </strong>Went on my first trip, to Mussorie.<br><strong>24th May 2012: </strong>Left for Kota.<br><strong>7th June 2012: </strong>Decided not to cry over Yashi again. That was the day our relationship actually ended for me, although I didn't tell her.<br><strong>2nd March 2013: </strong>Still in Kota, watched Avengers in a cyber cafe. Felt guilty.<br><strong>14th April 2013: </strong>I was going from home to Kota after giving UPTU exam, got off the train in LKO and went to surprise Yashi. Had sex for the last time.<br><strong>30th May 2013: </strong>Left Kota for good, broke my sim, disappeared from Yashi's life without telling her.<br><strong>2nd June 2013: </strong>IIT exam, was with Ajit basically for the whole day (like any other day).<br><strong>27th July 2013: </strong>Went for Ajit's College admission.<br><strong>12 August 2013:</strong> Got my admission in college.<br><strong>29th September 2013: </strong>Went for lecture in DTU on ethical hacking, don't give a shit about hacking but basically my programming started from this day onwards.<br><strong>9th February 2014: </strong>Went for auto expo with my roommate Balveer. We were late. All tickets sold out. We had to come back disappointed. My quote on water.<br><strong>2nd March 2014: </strong>My whole 1st year gang&mdash; Kartik, Aashish, Varun, Balveer, Pols and I went for dinner.<br><strong>11th March 2015:</strong> Registered on Codeforces.<br><strong>4th August 2015:</strong> Started serious trainings.<br><strong>4th December 2015:</strong> Ended the training spree with more than 500 problems solved.<br><strong></strong>",
        "tags": [
            "personal",
            "turning points"
        ],
        "time": "3 September 2017",
        "title": "Turning points"
    },
    {
        "content": "<p><strong>Disclaimer:</strong> The following content may seem egoistic with a sense of self-importance all over it and this is because it is strongly centered around myself. I know this is all bullshit and doesn't matter shit when you look at the big picture and most of the people go through this. I should think less about these weird things.</p><p>I have been the boy who was so shy that he would give up his necessities just so others can enjoy. I guess it was because I subconsciously wanted people to like me. I went through a fucked up phase from class 6th to 10th, basically the first half of the teenage years. My self-esteem was at record-low and I was overly conscious about what other people thought about me. It was outrageous, I consistently used to put myself through weird peer pressure and comparing myself to others was also at peak. I was fucked up, I was afraid of people and made everything awkward when I was with them. This could be the effect of me trying to be different (search for the blog named, \"Sucker for the road less travelled\").</p><p>I didn't have much confidence or a strong belief in anything or anything interesting about myself even when I reached class 11. Actually, I saw some improvement in the last one. But still, confidence and beliefs had no effect on them. Fast forward 6 years of self-induced trauma, shitty beliefs, and record-low self-esteem, it was the second half of 2015 when I started seeing improvement in both confidence and my beliefs(values). I have figured out that the practice I did in competitive programming to be the reason for this. Four months of continuous practice, day and night. I actually poured my sweat and tears in the practice. It was awesome. It's almost 2 years since that time and I still am proud of it. I improved me a lot, it brought to the spotlight, in front of the college, people started considering me \"the real deal\". That definitely did well for my confidence.</p><p>2016 was fine as well, I was speaking up for myself, I started getting more into psychology and philosophy, but not that serious. It was mid-2017 when shit started to make sense to me as I went further into nihilism and disparity. May of 2017 was the month I really started to experiment with my beliefs, started testing my thresholds in depression, depravement and anxiety and started questioning everything. I found that all humans are flawed, each one of us has a different set of flaws and comparing two humans would be like comparing apples and oranges. Comparision should be done only when either of the parties doesn't get their ego hurt upon losing. You know, the parties should be clever enough to think about it constructively. Although, for the superficial society we live in, even that's a stretch. People are way too much affected by other people's successes and failures. In an ideal world, comparing wouldn't exist, for the people of the ideal world would know the real meaning of freedom. This eventually brought confidence. If I got no respect for humans (myself included) then why fear them?</p><p>I have been summoned by some higher-up staff of all the institutions I've been in countless times before, I was used to this already way back in childhood, but up until last year I never spoke up for myself. But now, when I walk into an office I read the shit out of them. I now understand what people are capable of doing, what's going in their head, their general behaviour towards others and what it tells about them, the things they want to hear, the type of mind they have, the things that would trigger them, the things that would defuse the situation (if it arises) due to my own flaws or in the plan, the things I would bring up that would eventually morph and end up being in my favor 5 minutes after. I'm able to manipulate them because now I know their place in this world and more importantly mine.</p>",
        "tags": [
            "confidence",
            "personal"
        ],
        "time": "11 September 2017",
        "title": "Confidence"
    },
    {
        "content": "<p>I don't talk about those who are this close to me but I decided to start writing on bands and obviously Iron Maiden just had to be the first one. Now I feel like I won't be able to describe them well enough, the reason why I don't talk about them in the first place. Iron Maiden was formed on 25th December 1975. Any band with 42 years under its belt is bound to have multiple facets where they excel tremendously. Okay, let me describe them one by one.</p><h2><u>Influence</u></h2>First of all, you need to know who the hell I am talking about here, you need to know the respect and influence they have in the metal scene. In metal, there are four big bands, the bands that became so big they made their way into mainstream entertainment. These bands are Slayer(1981), Anthrax(1981), Megadeth(1983) and Metallica(1981), they are called the \"The Big Four\". Each one of these bands has inspired generations (yeah, plural!) hence, have a vast army of loyal followers and are considered the bands that shaped metal. All four of them have acknowledged the influence Iron Maiden had on them in their making. The other band from Iron Maiden's early years, 1970s, Black Sabbath(1968), which wielded power and influence on Maiden's level, disassembled in 2017 leaving Iron Maiden the sole forefather of heavy metal which is still going strong even after 42 years of it's inception.</p><p>Iron Maiden has recorded 134 songs as of 2017 divided among 16 studio albums and 11 live albums with 43 songs making it in various country's Top 100 charts. Leading to 10 of their albums being given platinum status, 4 of their albums being given gold status and the remaining 2 albums begin given silver status. Yeah, let that sink in for a moment.</p><img style=\"padding: 10px 0px\" src = 'https://h8sfkg.bn1301.livefilestore.com/y4ms_aRp5Ia7ffd0UOEw6Bxi09V6O3lPCX0ZUpLmBvRQRwgnDDc9yQAShJcpkMywsjr35G3JDfv-_rUwJGAIuVHiJM_KXSHTnChQkgCKRahK-kAtIiaFuZk8xrDSW5btsbHZrEmYvzzQZ1uaeXaXPPBiHjGt0ssgRNcYyAVIwqPfL2Qk_7Q6oje0EihwGnarOiF?width=1920&height=1080&cropmode=none' width='100%'><h2 style=\"color:lightgray\"><u>Music</u></h2><p>(not completed, to be continued...)</p>",
        "tags": [
            "music",
            "heavy metal",
            "british metal",
            "the best",
            "iron maiden",
            "up the irons!!"
        ],
        "time": "12 September 2017",
        "title": "Iron Maiden"
    }
]